Revit 2026 API

# ExclusionFilter Constructor

---

Initializes a new instance of the ExclusionFilter class

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public ExclusionFilter(
	ICollection<ElementId> idsToExclude
)
```
```vb
Public Sub New (
	idsToExclude As ICollection(Of ElementId)
)
```
```cpp
public:
ExclusionFilter(
	ICollection<ElementId^>^ idsToExclude
)
```
```fsharp
new :
        idsToExclude : ICollection<ElementId> -> ExclusionFilter
```

#### Parameters

idsToExclude ICollectionElementId

#### Reference

ExclusionFilter Class

Autodesk.Revit.DB Namespace